Name: Saleh Abdallah

In [29]:
import pandas as pd
import random
import os
import warnings
warnings.filterwarnings('ignore')

Data Format Conversion

In [17]:
# Create a dataset containing 100 records of fictional user data
names = ['Chris', 'Simon', 'Rohit', 'Davis', 'Alex', 'Nicole', 'Amelia', 'Sophie']
cities = ['Toronto', 'Vancouver', 'Montreal', 'Calgary', 'Ottawa', 'Edmonton', 'Winnipeg', 'Halifax']
dataset = {
    'Name': [random.choice(names) for i in range(100)],
    'Age': [random.randint(15, 65) for i in range(100)],
    'City': [random.choice(cities) for i in range(100)]
}

df = pd.DataFrame(dataset)
df.head()

     Name  Age       City
0  Sophie   47   Winnipeg
1   Simon   36    Calgary
2  Sophie   21    Toronto
3   Chris   22   Edmonton
4   Davis   47  Vancouver

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    100 non-null    object
 1   Age     100 non-null    int64
 2   City    100 non-null    object
dtypes: int64(1), object(2)
memory usage: 2.5+ KB

In [18]:
# Convert to CSV
df.to_csv('sample_data.csv', index=False)

In [19]:
# Convert the CSV file to Parquet
df.to_parquet('sample_data.parquet')

In [ ]:
# Compare the file sizes 
csv_size = os.path.getsize('sample_data.csv')
parquet_size = os.path.getsize('sample_data.parquet')
print('CSV file size is: ', csv_size)
print('Parquet file size is: ', parquet_size)
###
# The CSV file is smaller than the Parquet file
###

CSV file size is:  1905
Parquet file size is:  3261

In [ ]:
# Load the Parquet file back into a DataFrame
df_parquet = pd.read_parquet('sample_data.parquet')
df_parquet.head()

     Name  Age       City
0  Sophie   47   Winnipeg
1   Simon   36    Calgary
2  Sophie   21    Toronto
3   Chris   22   Edmonton
4   Davis   47  Vancouver

Implementing ETL Process

In [32]:
# Extract data from a CSV file.
df = pd.read_csv('sample_data.csv')
# Transform the data by filtering out records where the age is below 18 and converting the names to uppercase.
df_transformation = df[df['Age'] >= 18]
df_transformation['Name'] = df_transformation['Name'].str.upper()
# Load the transformed data into a new CSV file.
df_transformation.to_csv('transformed_sample_data.csv', index=False)
# Verify the transformation by loading and displaying the new file.
df = pd.read_csv('transformed_sample_data.csv')
df.describe().round(2) # min age is 18

         Age
count  94.00
mean   41.45
std    13.44
min    18.00
25%    30.25
50%    40.00
75%    54.00
max    64.00

In [34]:
df.head() # all names are in uppercase

     Name  Age       City
0  SOPHIE   47   Winnipeg
1   SIMON   36    Calgary
2  SOPHIE   21    Toronto
3   CHRIS   22   Edmonton
4   DAVIS   47  Vancouver

Exploring Data Models with SQLite and MongoDB

In [ ]:
# Install SQLite and MongoDB clients on your computer.
import sqlite3
# Do the following tasks using python code. You can use any SQLite or MongoDB GUI to explore more operations but the deliverables for this tasks must be in python.
conn = sqlite3.connect('users.db')
cursor = conn.cursor()
# Create a relational database in SQLite with a table to store user data (ID, Name, Age, City).
cursor.execute('''
    CREATE TABLE IF NOT EXISTS users (
        ID INTEGER PRIMARY KEY,
        Name TEXT,
        Age INTEGER,
        City TEXT
    )
''')
# Insert at least 5 records into the table and retrieve the data using an SQL query in python.
users = [
    (1, 'Chris', 25, 'Toronto'),
    (2, 'Simon', 30, 'Vancouver'),
    (3, 'Davis', 19, 'Ottawa'),
    (4, 'Nicole', 45, 'Montreal'),
    (5, 'Sophie', 35, 'Calgary')
]
cursor.executemany('INSERT INTO users VALUES (?, ?, ?, ?)', users)
conn.commit()
# Retrieve data
cursor.execute('SELECT * FROM users')
rows = cursor.fetchall()
# Display results
print('SQLite Data:')
for row in rows:
    print(row)
conn.close()

SQLite Data:
(1, 'Chris', 25, 'Toronto')
(2, 'Simon', 30, 'Vancouver')
(3, 'Davis', 19, 'Ottawa')
(4, 'Nicole', 45, 'Montreal')
(5, 'Sophie', 35, 'Calgary')

In [ ]:
# Create a similar dataset in MongoDB using the document model.
from pymongo import MongoClient
# Connect to MongoDB
client = MongoClient('mongodb://localhost:27017/')
# Create a database and collection
db = client['users_db']
collection = db['users']
# Insert the records as documents and retrieve them using a MongoDB query.
user_docs = [
    {'ID': 1, 'Name': 'Chris', 'Age': 25, 'City': 'Toronto'},
    {'ID': 2, 'Name': 'Simon', 'Age': 30, 'City': 'Vancouver'},
    {'ID': 3, 'Name': 'Davis', 'Age': 19, 'City': 'Ottawa'},
    {'ID': 4, 'Name': 'Nicole', 'Age': 45, 'City': 'Montreal'},
    {'ID': 5, 'Name': 'Sophie', 'Age': 35, 'City': 'Calgary'}
]
collection.insert_many(user_docs)
# Retrieve and display data
print('MongoDB Data:')
for doc in collection.find():
    print(doc)
client.close()
# Compare the flexibility and ease of use between the two models.
###
# SQLite is more flexible for structured data. 
# MongoDB is more flexible, for semi-structured or unstructured data. 
###

MongoDB Data:
{'_id': ObjectId('686f25cb8cdf23e242af4517'), 'ID': 1, 'Name': 'Chris', 'Age': 25, 'City': 'Toronto'}
{'_id': ObjectId('686f25cb8cdf23e242af4518'), 'ID': 2, 'Name': 'Simon', 'Age': 30, 'City': 'Vancouver'}
{'_id': ObjectId('686f25cb8cdf23e242af4519'), 'ID': 3, 'Name': 'Davis', 'Age': 19, 'City': 'Ottawa'}
{'_id': ObjectId('686f25cb8cdf23e242af451a'), 'ID': 4, 'Name': 'Nicole', 'Age': 45, 'City': 'Montreal'}
{'_id': ObjectId('686f25cb8cdf23e242af451b'), 'ID': 5, 'Name': 'Sophie', 'Age': 35, 'City': 'Calgary'}